mhavill/MRPMG-Docklands/ESP/3_Let's_chat/Code-PIO/ESP32 Server/src/server.cpp
/*******************************
 * Header
 * Name: server.cpp
 * Purpose: Sample Webserver woth 64x32 RGB display
 * Created Date: 26/03/2025
 * Updated Date: 15/1/2026
 *******************************/

/*******************************
 * Includes
 *******************************/
#include <Arduino.h>

#include <WiFi.h>
#include <WiFiClient.h>
#include <WebServer.h>
#include <ESPmDNS.h>
#include <arduino-timer.h>
#include <WiFiManager.h>

// #include "secrets.h"

#include <ESP32-HUB75-MatrixPanel-I2S-DMA.h>
#include <GFX_Layer.hpp>

// Webpage
#include "landing_page.h"
#include "animations_page.h" 
#include "text_message_page.h"
#include "vumeter_page.h"
#include <iostream>
#include <string>

// NeoPixel
#include "neopixel.hpp"

// Filesystem
#include "FS.h"
#include <LittleFS.h>
#include <AnimatedGIF.h>

/*******************************
 * Protptypes
 *******************************/

void handleNotFound();
void setup();
void loop();
String urlDecode(String input);
void MainPage();
void MainPageSubmit();
void LEDControl();
void layer_draw_callback(int16_t x, int16_t y, uint8_t r_data, uint8_t g_data, uint8_t b_data);
uint16_t colorWheel(uint8_t pos);
void printTextRainbowCentered(int colorWheelOffset, const char *text, int yPos);
void scrollText(int colorWheelOffset, const char *text);
void drawTextCentered(int colorWheelOffset, const char *text, int yPos);
void updateBackground();
bool display(void *);
bool wmloop(void *);

void GIFDraw(GIFDRAW *pDraw);
void *GIFOpenFile(const char *fname, int32_t *pSize);
void GIFCloseFile(void *pHandle);
int32_t GIFReadFile(GIFFILE *pFile, uint8_t *pBuf, int32_t iLen);
int32_t GIFSeekFile(GIFFILE *pFile, int32_t iPosition);
void ShowGIF(char *name);

/*******************************
 * Definitions
 *******************************/


#define device "ESP32server"
const int SECOND = 1000;
static float tempC;
// static DeviceAddress deviceAddress;
// static bool waitForConversion = false;



WebServer server(80);

const int LED = 2;

auto timer = timer_create_default(); // create a timer with default settings

/*  Default library pin configuration for the reference
  you can redefine only ones you need later on object creation
  */
#define R1 25
#define G1 26
#define BL1 27
#define R2 14
#define G2 12
#define BL2 13
#define CH_A 23
#define CH_B 22
#define CH_C 5
#define CH_D 18 // replaced from pin 17 is faulty?
#define CH_E 32 // assign to any available pin if using panels with 1/32 scan
#define CLK 19  // replaced from pin 16 is faulty?
#define LAT 4
#define OE 15

// Configure for your panel(s) as appropriate!
#define PIN_E 32
#define PANEL_WIDTH 64
#define PANEL_HEIGHT 32 // Panel height of 64 will required PIN_E to be defined.

#define PANELS_NUMBER 1 // Number of chained panels, if just a single panel, obviously set to 1

#define PANE_WIDTH PANEL_WIDTH *PANELS_NUMBER
#define PANE_HEIGHT PANEL_HEIGHT
#define NUM_LEDS PANE_WIDTH *PANE_HEIGHT

#define FILESYSTEM LittleFS
#define FORMAT_LITTLEFS_IF_FAILED true

#define PANEL_RES_X 64 // Number of pixels wide of each INDIVIDUAL panel module.
#define PANEL_RES_Y 32 // Number of pixels tall of each INDIVIDUAL panel module.
#define PANEL_CHAIN 1  // Total number of panels chained one to another horizontally only.

uint16_t colorWheel(uint8_t pos);
char ssid[32] = {0};

//------------------------------------------------------------------------------------------------------------------

MatrixPanel_I2S_DMA *dma_display = nullptr;

uint16_t myBLACK = dma_display->color565(0, 0, 0);
uint16_t myWHITE = dma_display->color565(255, 255, 255);
uint16_t myRED = dma_display->color565(255, 0, 0);
uint16_t myGREEN = dma_display->color565(0, 255, 0);
uint16_t myBLUE = dma_display->color565(0, 0, 255);

AnimatedGIF gif;
File f;
int x_offset, y_offset;

//------------------------------------------------------------------------------------------------------------------

//====================== Variables For scrolling Text=====================================================
unsigned long isAnimationDue;
int delayBetweeenAnimations = 18;               // Smaller == faster
int textXPosition = PANEL_WIDTH * CHAIN_LENGTH; // Will start off screen
int textYPosition = PANEL_HEIGHT / 2 - 7;       // center of screen - 8 (half of the text height)
//====================== Variables For scrolling Text=====================================================

// Pointers to this variable will be passed into getTextBounds,
// they will be updated from inside the method
int16_t xOne, yOne;
uint16_t w, h;

unsigned long last_increment = 0;
unsigned long increment_amt = 0;
// Global GFX_Layer object
GFX_Layer gfx_layer_bg(PANEL_WIDTH *CHAIN_LENGTH, PANEL_HEIGHT, layer_draw_callback); // background
GFX_Layer gfx_layer_fg(PANEL_WIDTH *CHAIN_LENGTH, PANEL_HEIGHT, layer_draw_callback); // foreground

GFX_LayerCompositor gfx_compositor(layer_draw_callback);

uint8_t wheelval = 0;

std::string upper_msg;
std::string lower_msg;
std::string top_msg;
uint16_t background = 10;
uint16_t speed = 18;

// select which pin will trigger the configuration portal when set to LOW
#define TRIGGER_PIN 33
/****************************
 * GIF Playback Variables
 ****************************/
String gifDir = "/gifs"; // play all GIFs in this directory on the SD card
char filePath[256] = {0};
File root, gifFile;

/*******************************
 * Setup
 *******************************/
void setup(void)
{
  // Start the serial port
  Serial.begin(115200);
  delay(SECOND);
  pinMode(TRIGGER_PIN, INPUT_PULLUP);
  // Start the neopixel
  npsetup();

  WiFiManager wm;

  bool res;

  // wm.resetSettings();

  res = wm.autoConnect("AutoConnectAP", "password"); // password protected ap
  if (!res)
  {

    Serial.println("Failed to connect");

    ESP.restart();
  }

  // Start the WiFi
  // WiFi.mode(WIFI_STA);
  WiFi.hostname(device);
  strcpy((char *)ssid, WiFi.SSID().c_str());
  // WiFi.begin(ssid, password);
  Serial.println("");

  // Wait for connection
  while (WiFi.status() != WL_CONNECTED)
  {
    delay(500);
    Serial.print(".");
  }
  Serial.println("");
  Serial.print("Connected to ");
  Serial.println(ssid);
  Serial.print("IP address: ");
  Serial.println(WiFi.localIP());

