mhavill/MRPMG-Docklands/ESP/3_Let's_chat/Code-PIO/ESP32 Server/src/server.cpp
  if (MDNS.begin(device))
  {
    Serial.printf("MDNS responder started with name %s.local\n", device);
  }

  timer.every(0.5 * SECOND, npblink);
  // timer.every(speed, display);
  timer.every(3 * SECOND, wmloop);

  /***********************************
   * Web Server Handlers
   * ******************************/
  server.on("/", HTTP_GET, []() {
  // Serve landing page
  server.send(200, "text/html", landing_page_html);
});

server.on("/setmode", HTTP_POST, []() {
  String mode = server.arg("mode");
  
  if (mode == "text") {
    server.send(200, "text/html", text_message_page_html);
  } else if (mode == "animations") {
    // Start animations on display
    server.send(200, "text/html", animations_page_html);
  } else if (mode == "vumeter") {
    server.send(200, "text/html", vumeter_page_html);
  } else if (mode == "stop") {
    // Stop current mode
    server.send(200, "text/html", landing_page_html);
  }
});
  // server.on("/", MainPage); /*Client request handling: calls the function to serve HTML page */

  // server.on("/inline", []()
  //           { server.send(200, "text/plain", "this works as well"); });

  // server.on("/submit", HTTP_POST, MainPageSubmit);
  // // server.on("/submit", HTTP_POST, []()

  // server.on("/LEDupdate", LEDControl);

  // server.onNotFound(handleNotFound);

  // server.begin();
  // Serial.println("HTTP server started");

  Serial.println("Starting MatrixPanel_I2S_DMA test...");
  // Custom pin mapping for all pins
  HUB75_I2S_CFG::i2s_pins _pins = {R1, G1, BL1, R2, G2, BL2, CH_A, CH_B, CH_C, CH_D, CH_E, LAT, OE, CLK};

  HUB75_I2S_CFG mxconfig(
      PANEL_WIDTH,  // width
      PANEL_HEIGHT, // height
      CHAIN_LENGTH, // chain length
      _pins         // pin mapping
  );

  mxconfig.i2sspeed = HUB75_I2S_CFG::HZ_20M;

  dma_display = new MatrixPanel_I2S_DMA(mxconfig);
  dma_display->begin();
  dma_display->setBrightness8(128); // 0-255
  dma_display->clearScreen();

  // Clear the layers
  gfx_layer_fg.clear();
  gfx_layer_fg.setTextWrap(false);

  gfx_layer_bg.clear();

  // set up initial messages
  lower_msg = ssid;
  upper_msg = "Is this working?";
  top_msg = "MTG";
  Serial.printf("lower_msg = %s, upper_msg = %s \n", lower_msg.c_str(), upper_msg.c_str());
  if(!LittleFS.begin(FORMAT_LITTLEFS_IF_FAILED)){
      Serial.println("LittleFS Mount Failed");
      return;
  }
  Serial.println("LittleFS Mounted Successfully");


  // Start going through GIFS
  gif.begin(LITTLE_ENDIAN_PIXELS);
}

/*******************************
 * Loop
 *******************************/

void loop(void)
{
  server.handleClient();

  // while (1) // run forever
  // {
    timer.tick();

    root = FILESYSTEM.open(gifDir);
    if (root)
    {
      gifFile = root.openNextFile();
      while (gifFile)
      {
        if (!gifFile.isDirectory()) // play it
        {

          // C-strings... urghh...
          memset(filePath, 0x0, sizeof(filePath));
          strcpy(filePath, gifFile.path());

          // Show it.
          ShowGIF(filePath);
        }
        gifFile.close();
        gifFile = root.openNextFile();
      }
      root.close();
    } // root

    delay(1000); // pause before restarting

//   } // while
}

/*******************************
 * Utility Functions
 *******************************/
bool wmloop(void *)
{
  // is configuration portal requested?
  if (digitalRead(TRIGGER_PIN) == LOW)
  {
    WiFiManager wm;

    // reset settings - for testing
    wm.resetSettings();

    ESP.restart();
  }
  return true;
}

String urlDecode(String input)
{
  String decoded = "";
  char a, b;
  unsigned int len = input.length();

  // Serial.println("=== Starting URL Decode ===");
  // Serial.print("Input length: ");
  // Serial.println(len);
  // DON'T print the whole string at once - it might be corrupted

  for (unsigned int i = 0; i < len; i++)
  {
    char c = input[i];

    // Print each character carefully
    // Serial.print("Pos ");
    // Serial.print(i);
    // Serial.print(": ");
    // Serial.println((int)c);

    if (c == '+')
    {
      decoded += ' ';
    }
    else if (c == '%')
    {
      if (i + 2 < len)
      {
        a = input[i + 1];
        b = input[i + 2];

        // Convert hex digits to decimal
        if (a >= '0' && a <= '9')
          a = a - '0';
        else if (a >= 'a' && a <= 'f')
          a = a - 'a' + 10;
        else if (a >= 'A' && a <= 'F')
          a = a - 'A' + 10;

        if (b >= '0' && b <= '9')
          b = b - '0';
        else if (b >= 'a' && b <= 'f')
          b = b - 'a' + 10;
        else if (b >= 'A' && b <= 'F')
          b = b - 'B' + 10;

        decoded += char(16 * a + b);
        i += 2;
      }
      else
      {
        decoded += '%';
      }
    }
    else
    {
      decoded += c;
    }
  }

  // Serial.println("=== Decode Complete ===");

  return decoded;
}

bool display(void *)
{
  updateBackground();
  scrollText(wheelval, upper_msg.c_str());                   // Prints Scrolling text with a rainbow color
  printTextRainbowCentered(wheelval, lower_msg.c_str(), 25); // Prints text X-Centered to chosen Y position with rainbow color
  printTextRainbowCentered(wheelval, top_msg.c_str(), 0);    // Prints text X-Centered to chosen Y position with rainbow color
  // printTextRainbowCentered(wheelval, lower_msg.c_str(), 24);  //Prints text X-Centered to chosen Y position with rainbow color
  // scrollText(wheelval, lower_msg.c_str());  //Prints text X-Centered to chosen Y position with rainbow color

  // gfx_layer_fg.display();
  // gfx_layer_bg.display();

  gfx_compositor.Blend(gfx_layer_bg, gfx_layer_fg); // blend and immediately display

  wheelval += 1;
  // update timer interval in case it changed
  timer.every(100 / speed, display);
  return true;
}
// DONE Change to Neopixel

void handleNotFound()
{

  String message = "File Not Found\n\n";
  message += "URI: ";
  message += server.uri();
  message += "\nMethod: ";
  message += (server.method() == HTTP_GET) ? "GET" : "POST";
  message += "\nArguments: ";
  message += server.args();
  message += "\n";
  for (uint8_t i = 0; i < server.args(); i++)
  {
    message += " " + server.argName(i) + ": " + server.arg(i) + "\n";
  }
  server.send(404, "text/plain", message);
  Serial.println(message);
}
// void MainPage()
// {
//   String _html_page = html_page;             /*Read The HTML Page*/
//   server.send(200, "text/html", _html_page); /*Send the code to the web server*/
// }

void MainPageSubmit()
{

  String upperText = server.arg("upperText");
  String lowerText = server.arg("lowerText");
  String topText = server.arg("topText");

  speed = server.arg("speed").toInt() * 10;
  background = server.arg("background").toInt();

  // Decode the URL-encoded strings
  String upperText2 = urlDecode(upperText);
  String lowerText2 = urlDecode(lowerText);
  String topText2 = urlDecode(topText);

  Serial.println(" ***************************");
  Serial.print("Received upperText: ");
  Serial.println(upperText2);
  Serial.print("Received lowerText: ");
  Serial.println(lowerText2);

  Serial.print("Received topText: ");
  Serial.println(topText2);
  Serial.print("Received speed: ");
  Serial.println(speed);
  Serial.print("Received background: ");
  Serial.println(background);

  // // Now use upperText and lowerText - they should have the correct characters
  // Serial.println(upperText2);
  // Serial.println(lowerText2);

  server.send(200, "text/plain", "Messages received!");

  // Clear first, then assign with explicit std::string construction
  upper_msg.clear();
  lower_msg.clear();
  top_msg.clear();

