mhavill/MRPMG-Docklands/ESP/3_Let's_chat/Code-PIO/ESP32 Server/src/server.cpp
  upper_msg = std::string(upperText2.c_str());
  lower_msg = std::string(lowerText2.c_str());
  top_msg = std::string(topText2.c_str());

  // Serial.print("upper_msg = ");
  // Serial.print(upper_msg.c_str());
  // Serial.print(", lower_msg = ");
  // Serial.println(lower_msg.c_str());
  // Serial.println(" ***************************");
}

void LEDControl()
{
  // Stop the LED from blinking
  blink = false;
  Serial.println("LED Control activated");
  String message = "LED Control activated\n\n";
  message += "URI: ";
  message += server.uri();
  message += "\nMethod: ";
  message += (server.method() == HTTP_GET) ? "GET" : "POST";
  message += "\nArguments: ";
  message += server.args();
  message += "\n";
  for (uint8_t i = 0; i < server.args(); i++)
  {
    message += " " + server.argName(i) + ": " + server.arg(i) + "\n";
  }
  Serial.print(message);
  uint8_t LEDred = server.arg(0).toInt();   // Convert and read the LED red
  uint8_t LEDgreen = server.arg(1).toInt(); // Convert and read the LED green
  uint8_t LEDblue = server.arg(2).toInt();  // Convert and read the LED blue
  // theaterChase(strip.Color(LEDred, LEDgreen, LEDblue), 50); // Set the LED colour
  strip.setPixelColor(0, strip.Color(LEDred, LEDgreen, LEDblue));
  Serial.printf("Red %d, Green %d, Blue %d", LEDred, LEDgreen, LEDblue);
  strip.show();

  server.send(200, "text/plane", message); // Send the LED status to the web server
}

//------------------------------------------------------------------------------------------------------------------
// The layers don't draw to hardware directly, they use a callback function.
// You could be smart here and additionally draw to the VirtualMatrixPanel_T class...
void layer_draw_callback(int16_t x, int16_t y, uint8_t r_data, uint8_t g_data, uint8_t b_data)
{

  dma_display->drawPixelRGB888(x, y, r_data, g_data, b_data);
}

//------------------------------------------------------------------------------------------------------------------
// Input a value 0 to 255 to get a color value.
// The colours are a transition r - g - b - back to r.
// From: https://gist.github.com/davidegironi/3144efdc6d67e5df55438cc3cba613c8

uint16_t colorWheel(uint8_t pos)
{
  if (pos < 85)
  {
    return dma_display->color565(pos * 3, 255 - pos * 3, 0);
  }
  else if (pos < 170)
  {
    pos -= 85;
    return dma_display->color565(255 - pos * 3, 0, pos * 3);
  }
  else
  {
    pos -= 170;
    return dma_display->color565(0, pos * 3, 255 - pos * 3);
  }
}
void printTextRainbowCentered(int colorWheelOffset, const char *text, int yPos)
{
  gfx_layer_fg.setTextSize(1); // size 1 == 8 pixels high

  // Calculate the width of the text in pixels
  int textWidth = strlen(text) * 6; // Assuming 6 pixels per character for size 1

  // Center the text horizontally
  int xPos = (gfx_layer_fg.width() - textWidth) / 2;

  gfx_layer_fg.setCursor(xPos, yPos); // Set cursor position for centered text
                                      // Clear the area of text to be drawn to
  gfx_layer_fg.drawRect(0, yPos, gfx_layer_fg.width(), 8, gfx_layer_fg.color565(0, 0, 0));
  gfx_layer_fg.fillRect(0, yPos, gfx_layer_fg.width(), 8, gfx_layer_fg.color565(0, 0, 0));

  // Draw text with a rotating color
  for (uint8_t w = 0; w < strlen(text); w++)
  {
    gfx_layer_fg.setTextColor(colorWheel((w * 32) + colorWheelOffset));
    gfx_layer_fg.print(text[w]);
  }
}

// Code taken from: https://github.com/witnessmenow/ESP32-Trinity/blob/master/examples/BuildingBlocks/Text/ScrollingText/ScrollingText.ino
//
void scrollText(int colorWheelOffset, const char *text)
{

  const char *str = text;
  byte offSet = 25;
  unsigned long now = millis();
  if (now > isAnimationDue)
  {

    gfx_layer_fg.setTextSize(2); // size 2 == 16 pixels high

    isAnimationDue = now + delayBetweeenAnimations;
    textXPosition -= 1;

    // Checking is the very right of the text off screen to the left
    gfx_layer_fg.getTextBounds(str, textXPosition, textYPosition, &xOne, &yOne, &w, &h);
    if (textXPosition + w <= 0)
    {
      textXPosition = gfx_layer_fg.width() + offSet;
    }

    gfx_layer_fg.setCursor(textXPosition, textYPosition);

    // Clear the area of text to be drawn to
    gfx_layer_fg.drawRect(0, textYPosition, gfx_layer_fg.width(), 16, gfx_layer_fg.color565(0, 0, 0));
    gfx_layer_fg.fillRect(0, textYPosition, gfx_layer_fg.width(), 16, gfx_layer_fg.color565(0, 0, 0));

    uint8_t w = 0;
    for (w = 0; w < strlen(str); w++)
    {
      gfx_layer_fg.setTextColor(colorWheel((w * 32) + colorWheelOffset));
      // gfx_layer_fg.setTextColor(gfx_layer_fg.color565(255, 255, 255));
      gfx_layer_fg.print(str[w]);
    }
  }
}
void drawTextCentered(int colorWheelOffset, const char *text, int yPos)
{

  // draw text with a rotating colour
  gfx_layer_fg.setTextSize(1);      // size 1 == 8 pixels high
                                    // Calculate the width of the text in pixels
  int textWidth = strlen(text) * 6; // Assuming 6 pixels per character for size 1

  // Center the text horizontally
  int xPos = (gfx_layer_fg.width() - textWidth) / 2;

  gfx_layer_fg.setCursor(xPos, yPos); // start at top left, with 8 pixel of spacing
  uint8_t w = 0;

  //   // Clear the area of text to be drawn to
  // gfx_layer_fg.drawRect(0, yPos, gfx_layer_fg.width() , 16, gfx_layer_fg.color565(0, 0, 0));
  // gfx_layer_fg.fillRect(0, yPos, gfx_layer_fg.width() , 16, gfx_layer_fg.color565(0, 0, 0));

  // const char *str = "ESP32 DMA";
  const char *str = text;
  for (w = 0; w < strlen(str); w++)
  {
    gfx_layer_fg.setTextColor(colorWheel((w * 32) + colorWheelOffset));
    gfx_layer_fg.print(str[w]);
  }
}

void updateBackground()
{

  CRGBPalette16 currentPalette = CloudColors_p;

  if ((millis() - last_increment) > 20)
  {
    increment_amt++;
    last_increment = millis();
  }

  for (int x = 0; x < gfx_layer_bg.width(); x++)
  {
    for (int y = 0; y < gfx_layer_bg.height(); y++)
    {

      int val = sin8(x + increment_amt);
      val += sin8(y + increment_amt);

      CRGB currentColor = ColorFromPalette(currentPalette, val); //, brightness, currentBlendType);

      // Set a pixel in the back layer
      gfx_layer_bg.setPixel(x, y, currentColor.r, currentColor.g, currentColor.b);
    }
  }

  gfx_layer_bg.dim(background); // darken it a little
}

/***********************
 * Gif File Handling
 **********************/
// Draw a line of image directly on the LED Matrix
void GIFDraw(GIFDRAW *pDraw)
{
  uint8_t *s;
  uint16_t *d, *usPalette, usTemp[320];
  int x, y, iWidth;

